Tekla Open API Reference for Tekla Structures 2025
WpfBoltCatalogStandard Properties
The WpfBoltCatalogStandard type exposes the following members.
Properties
Name | Description
BoltSizes
 Returns bolt sizes in catalog based on selected grade
Top
See Also
Reference
WpfBoltCatalogStandard Class
Tekla.Structures.Dialog.UIControls Namespace